Revit 2024 API
IndexPoint Constructor
 Constructs the point primitive.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public IndexPoint(
	int index
)
Visual Basic
Public Sub New ( _
	index As Integer _
)
Visual C++
public:
IndexPoint(
	int index
)
Parameters
index
Type: System.Int32
 The index of the point's vertex.
See Also
IndexPoint Class
Autodesk.Revit.DB.DirectContext3D Namespace